# vsoContextM_Add

## Description
Add an item to the context menu of the object during kObjOnContextMenuInit event.

```pascal
PROCEDURE vsoContextM_Add(
				locName : STRING;
				itemID  : INTEGER;
				helpID  : STRING);
```

```python
def vs.vsoContextM_Add(locName, itemID, helpID):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|locName|STRING|   |
|itemID|INTEGER|   |
|helpID|STRING|   |

## Version
Availability: from Vectorworks 2014

## Category
* Object Events